[
  {
    "id": "1",
    "image": "ilgotherapy",
    "title": "Иглотерапия",
    "text": "Иглотерапия — древнее искусство, которое с помощью тончайших игл пробуждает внутренние силы организма. Точки на теле, куда вводятся иглы, связаны с различными органами и системами, и их стимуляция помогает восстановить баланс, снять боль и улучшить общее самочувствие."
  },
  {
    "id": "2",
    "title": "Мануальная терапия",
    "image": "manualTherapy",
    "text": "Мануальная терапия — техника исцеления руками, которая возвращает телу естественную свободу движения. Специалист работает с позвоночником и суставами, устраняя блоки и напряжение, словно «включая» тело заново. После сеанса возникает ощущение легкости и обновления, как будто тело снова обрело свою естественную гибкость и силу."
  },
  {
    "id": "3",
    "image": "auriculotherapy",
    "title": "Аурикулотерапия",
    "text": "Аурикулотерапия — это метод, основанный на стимуляции биологически активных точек на ушной раковине. Каждая из этих точек связана с внутренними органами и системами организма. Воздействие на них с помощью игл или других инструментов помогает снять стресс, облегчить боль и восстановить баланс организма, воздействуя на его самые глубокие резервы."
  },
  {
    "id": "4",
    "image": "acupressure",
    "title": "Акупрессура",
    "text": "Акупрессура — это древняя техника, которая использует силу нажатия на биологически активные точки тела для стимуляции самоисцеления. В отличие от игл, здесь работают руки: нажатия пальцами или ладонями мягко, но уверенно воздействуют на точки, связанные с внутренними органами и системами. Это метод, который помогает снять боль, расслабиться и восстановить энергию, просто через прикосновения."
  },
  {
    "id": "5",
    "image": "electropuncture",
    "title": "Электропунктура",
    "text": "Электропунктура — современный метод, который объединяет традиционную иглотерапию и достижения электротерапии. Мягкие электрические импульсы подаются на точки, где установлены иглы, усиливая их воздействие и ускоряя процесс восстановления. Этот метод особенно эффективен для снятия боли и восстановления функций организма, сочетая древнюю мудрость и современные технологии."
  },
  {
    "id": "6",
    "image": "pir",
    "title": "Пиры",
    "text": "Постизометрическая релаксация (ПИР) — это мягкая, но невероятно эффективная техника, которая помогает снять мышечное напряжение, избавить от боли и вернуть подвижность суставам. Основной принцип ПИР — это чередование напряжения и расслабления мышц, после чего тело словно само по себе \"отпускает\" зажимы."
  }
]
